[
  {
    "id": 1,
    "name": "The Kite Runner",
    "author": "Khaled Hosseini",
    "image": "https://i.ibb.co/NnC8Vjp/the-kite-runner.jpg",
    "review": "1970s Afghanistan: Twelve-year-old Amir is desperate to win the local kite-fighting tournament and his loyal friend Hassan promises to help him. But neither of the boys can foresee what would happen to Hassan that afternoon, an event that is to shatter their lives. After the Russians invade and the family is forced to flee to America, Amir realises that one day he must return to an Afghanistan under Taliban rule to find the one thing that his new world cannot grant him: redemption.",
    "totalPages": 371,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Contemporary", "Historical"],
    "publisher": "Riverhead Books",
    "yearOfPublishing": 2004
  },
  {
    "id": 2,
    "name": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/NLCQ4QS/to-kill-a-mocking-bird.jpg",
    "review": "The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it. 'To Kill A Mockingbird' became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic. Compassionate, dramatic, and deeply moving, 'To Kill A Mockingbird' takes readers to the roots of human behavior - to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature.",
    "totalPages": 323,
    "rating": 4.6,
    "category": "Classic",
    "tags": ["Historical Fiction", "Literature"],
    "publisher": "Harper Perennial ",
    "yearOfPublishing": 2006
  },
  {
    "id": 3,
    "name": "The Hunger Games",
    "author": "Suzanne Collins",
    "image": "https://i.ibb.co/7J5rYDh/the-hunger-games.jpg",
    "review": "In the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. The Capitol is harsh and cruel and keeps the districts in line by forcing them all to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, a fight to the death on live TV. Sixteen-year-old Katniss Everdeen, who lives alone with her mother and younger sister, regards it as a death sentence when she steps forward to take her sister's place in the Games. But Katniss has been close to dead before—and survival, for her, is second nature. Without really meaning to, she becomes a contender. But if she is to win, she will have to start making choices that weight survival against humanity and life against love.",
    "totalPages": 374,
    "rating": 4.2,
    "category": "Fantasy",
    "tags": ["Science Fiction", "Teen"],
    "publisher": "Scholastic Press",
    "yearOfPublishing": 2008
  },

  {
    "id": 4,
    "name": "Divergent",
    "author": "Veronica Roth",
    "image": "https://i.ibb.co/jfRCd7Q/divergent.jpg",
    "review": "In Beatrice Prior's dystopian Chicago world, society is divided into five factions, each dedicated to the cultivation of a particular virtue—Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent). On an appointed day of every year, all sixteen-year-olds must select the faction to which they will devote the rest of their lives. For Beatrice, the decision is between staying with her family and being who she really is—she can't have both. So she makes a choice that surprises everyone, including herself.",
    "totalPages": 487,
    "rating": 4.1,
    "category": "Fantasy",
    "tags": ["Romance", "Science Fiction"],
    "publisher": "Katherine Tegen Books",
    "yearOfPublishing": 2011
  },

  {
    "id": 5,
    "name": "The Maze Runner",
    "author": "James Dashner",
    "image": "https://i.ibb.co/svR0DBZ/the-maze-runner.jpg",
    "review": "If you ain't scared, you ain't human. When Thomas wakes up in the lift, the only thing he can remember is his name. He's surrounded by strangers—boys whose memories are also gone. Nice to meet ya, shank. Welcome to the Glade. Outside the towering stone walls that surround the Glade is a limitless, ever-changing maze. It's the only way out—and no one's ever made it through alive.Everything is going to change.Then a girl arrives. The first girl ever. And the message she delivers is terrifying.Remember. Survive. Run.",
    "totalPages": 384,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Post Apocalyptic", "Thriller"],
    "publisher": "Delacorte Press",
    "yearOfPublishing": 2009
  },

  {
    "id": 6,
    "name": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/DkGjJQ2/the-hobbit.jpg",
    "review": "In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort.  Written for J.R.R. Tolkien's own children, The Hobbit met with instant critical acclaim when it was first published in 1937. Now recognized as a timeless classic, this introduction to the hobbit Bilbo Baggins, the wizard Gandalf, Gollum, and the spectacular world of Middle-earth recounts of the adventures of a reluctant hero, a powerful and dangerous ring, and the cruel dragon Smaug the Magnificent. The text in this 372-page paperback edition is based on that first published in Great Britain by Collins Modern Classics (1998), and includes a note on the text by Douglas A. Anderson (2001).",
    "totalPages": 366,
    "rating": 4.6,
    "category": "Classic",
    "tags": [" Fantasy", "Adventure"],
    "publisher": "Houghton Mifflin",
    "yearOfPublishing": 2002
  },

  {
    "id": 7,
    "name": "Eragon",
    "author": "Christopher Paolini",
    "image": "https://i.ibb.co/nBXvbvM/eragon.jpg",
    "review": "When Eragon finds a polished blue stone in the forest, he thinks it is the lucky discovery of a poor farm boy; perhaps it will buy his family meat for the winter. But when the stone brings a dragon hatchling, Eragon soon realizes he has stumbled upon a legacy nearly as old as the Empire itself.Overnight his simple life is shattered, and he is thrust into a perilous new world of destiny, magic, and power. With only an ancient sword and the advice of an old storyteller for guidance, Eragon and the fledgling dragon must navigate the dangerous terrain and dark enemies of an Empire ruled by a king whose evil knows no bounds.",
    "totalPages": 503,
    "rating": 3.9,
    "category": "Fantasy",
    "tags": ["Adventure", "Dragons"],
    "publisher": "Alfred A. Knopf",
    "yearOfPublishing": 2005
  },

  {
    "id": 8,
    "name": "The Fault in Our Stars",
    "author": "John Green",
    "image": "https://i.ibb.co/WxqV7SX/the-fault-in-out-stars.jpg",
    "review": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.Insightful, bold, irreverent, and raw, The Fault in Our Stars is award-winning author John Green's most ambitious and heartbreaking work yet, brilliantly exploring the funny, thrilling, and tragic business of being alive and in love.",
    "totalPages": 313,
    "rating": 4.1,
    "category": "Fiction",
    "tags": ["Contemporary", "Teen"],
    "publisher": "Dutton Books",
    "yearOfPublishing": 2012
  },

  {
    "id": 9,
    "name": "Matilda",
    "author": "Roald Dahl",
    "image": "https://i.ibb.co/FDyPTF2/matilda.jpg",
    "review": "Matilda is a little girl who is far too good to be true. At age five-and-a-half she's knocking off double-digit multiplication problems and blitz-reading Dickens. Even more remarkably, her classmates love her even though she's a super-nerd and the teacher's pet. But everything is not perfect in Matilda's world...For starters she has two of the most idiotic, self-centered parents who ever lived. Then there's the large, busty nightmare of a school principal, Miss ('The') runchbull, a former hammer-throwing champion who flings children at will, and is approximately as sympathetic as a bulldozer. Fortunately for Matilda, she has the inner resources to deal with such annoyances :astonishing intelligence, saintly patience, and an innate predilection for revenge.",
    "totalPages": 240,
    "rating": 4.4,
    "category": "Classic",
    "tags": ["Humor", "Children's classic"],
    "publisher": "Puffin",
    "yearOfPublishing": 1998
  }
]
